---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.DeletingCurtainSystemFaceGridLines
source: html/ae8245be-b61e-49e5-18da-5817928c5e30.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.DeletingCurtainSystemFaceGridLines Property

Deleting Grid Lines residing on faces that no longer are part of a Curtain System.

## Syntax (C#)
```csharp
public static FailureDefinitionId DeletingCurtainSystemFaceGridLines { get; }
```